#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_openid_connect_provider.this: Reading...
module.website.data.aws_iam_policy_document.website_iam_policy: Reading...
aws_ecr_repository.app: Refreshing state... [id=synapse]
module.website.data.aws_iam_policy_document.website_iam_policy: Read complete after 0s [id=115665691]
data.aws_iam_openid_connect_provider.this: Read complete after 0s [id=arn:aws:iam::789798665829:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.oidc: Reading...
data.aws_iam_policy_document.oidc: Read complete after 0s [id=3914002254]
aws_iam_role.this: Refreshing state... [id=github_oidc_role_synapse]
aws_ecr_repository_policy.app_policy: Refreshing state... [id=synapse]
aws_ecr_lifecycle_policy.app_lifecycle: Refreshing state... [id=synapse]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.app_lifecycle must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "app_lifecycle" {
      ~ id          = "synapse" -> (known after apply)
      ~ registry_id = "789798665829" -> (known after apply)
      ~ repository  = "synapse" -> "ui-forge-ai-studio" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_ecr_repository.app must be replaced
-/+ resource "aws_ecr_repository" "app" {
      ~ arn                  = "arn:aws:ecr:eu-central-1:789798665829:repository/synapse" -> (known after apply)
      ~ id                   = "synapse" -> (known after apply)
      ~ name                 = "synapse" -> "ui-forge-ai-studio" # forces replacement
      ~ registry_id          = "789798665829" -> (known after apply)
      ~ repository_url       = "789798665829.dkr.ecr.eu-central-1.amazonaws.com/synapse" -> (known after apply)
      - tags                 = {
          - "Repo" = "synapse"
        } -> null
      ~ tags_all             = {
          ~ "Repo"      = "synapse" -> "ui-forge-ai-studio"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_ecr_repository_policy.app_policy must be replaced
-/+ resource "aws_ecr_repository_policy" "app_policy" {
      ~ id          = "synapse" -> (known after apply)
      ~ registry_id = "789798665829" -> (known after apply)
      ~ repository  = "synapse" -> "ui-forge-ai-studio" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::789798665829:role/github_oidc_role_synapse" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike   = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:araltiparmak/synapse:ref:refs/heads/main" -> "repo:araltiparmak/ui-forge-ai-studio:ref:refs/heads/main"
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ create_date           = "2025-01-30T15:51:41Z" -> (known after apply)
      ~ id                    = "github_oidc_role_synapse" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "github_oidc_role_synapse" -> "github_oidc_role_ui-forge-ai-studio" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {
          - "Repo" = "synapse"
        } -> null
      ~ tags_all              = {
          ~ "Repo"      = "synapse" -> "ui-forge-ai-studio"
            # (1 unchanged element hidden)
        }
      ~ unique_id             = "AROA3PY5LHZS5ALRFAKMS" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.website.aws_s3_bucket.website_bucket will be created
  + resource "aws_s3_bucket" "website_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ui-forge-ai-studio"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "ManagedBy" = "Terraform"
          + "Repo"      = "ui-forge-ai-studio"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.website.aws_s3_bucket_policy.website_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "website_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:s3:::ui-forge-ai-studio/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.website.aws_s3_bucket_public_access_block.example will be created
  + resource "aws_s3_bucket_public_access_block" "example" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.website.aws_s3_bucket_website_configuration.website_configuration will be created
  + resource "aws_s3_bucket_website_configuration" "website_configuration" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

Plan: 8 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ ecr_repository_url = "789798665829.dkr.ecr.eu-central-1.amazonaws.com/synapse" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @araltiparmak, Action: `pull_request`*